import UIKit

/**
- Lv1
    - 입력받은 숫자에 따라 다른 로직을 실행하는 코드를 작성
    - if나 switch, guard 문을 활용
    - 반복문을 이용해서 특정 번호가 입력되면 프로그램을 종료
    - readline 함수로 값을 입력
- Lv2
    - 필요한 클래스들을 설계 (버거, 아이스크림, 음료, 맥주, 주문, 공통 등)
    - 클래스들의 프로퍼티와 메소드를 정의
    - 메소드를 이용해서 Lv1의 코드를 개선
- Lv3
    - Lv2에서 설계한 클래스들을 상속 관계를 가지도록 변경 (Burger도 부모 클래스를 가질 수 있을지 고민!)
    - 하나의 리스트객체로 모든 메뉴들을 관리하도록 수정 (List)
    - 선택한 리스트의 요소를 삭제
- Lv4*
    - 숫자를 입력해야하는데 문자를 입력했을때 다시 입력할 수 있도록 예외를 처리
    - 현재 잔액과 가격을 비교해서 구매 가능한 상태를 정의 (클래스 추가가능)
- Lv5*
    - 특정 작업이 종료된 후, 3초뒤에 다른 작업을 수행할 수 있도록 코드를 작성
    - 결제시 현재 시간을 비교하여 특정 시간대에는 결제할 수 없다는 알림창을 띄우기
    - 프로그램을 종료할때까지 5초마다 현재 주문 대기수를 실시간으로 출력
*/
